## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                    |
|--------|--------------------------------------------|
| add    | `aws_ecr_repository.cra_upd_update_db_ecr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.cra_upd_update_db_ecr will be created
  + resource "aws_ecr_repository" "cra_upd_update_db_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "cra-upd-dashboard-staging-update-db"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_update_db_repository_arn   = (known after apply)
  + ecr_update_db_repository_url   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.cra_upd_data_import_ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.cra_upd_ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.cra_upd_update_db_ecr"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
